Repository: exajobs/monitoring-collection
Catalog: nagios/plugins/snmp-plugins-c/po/*.po
Languages: fr

source: print extra debugging information (including list of elements found on the system)
fr: Affiche des informations de debug (ainsi que la liste d'éléments trouvée sur le système)

source: print this help message
fr: Affiche ce message d'aide

source: name or IP address of host to check
fr: Nom ou adresse IP de l'hôte à vérifier

source: community name for the host's SNMP agent (implies v1 protocol)
fr: Nom de communauté SNMP pour l'hôte (implique protocole v1)

source: Login and auth password for snmpv3 authentication
fr: Login et mot de passe pour l'authentification snmp v3

source: If no priv password exists, implies AuthNoPriv
fr: SI aucune clé de chiffrement n'est présente, alors AuthNoPriv

source: -2 : use snmp v2c
fr: -2 : utilise snmp v2c

source: Priv password for snmpv3 (AuthPriv protocol)
fr: Clé de chiffrement pour snmpv3 (Protocole AuthPriv)

source: <authproto> : Authentication protocol (md5|sha : default md5)
fr: <authproto> : Protocole d'authentification (md5|sha : défaut md5)

source: <privproto> : Priv protocole (des|aes : default des)
fr: <privproto> : Protocole de chiffrement (des|aes : défaut des)

source: SNMP port (Default 161)
fr: Port SNMP (161 par défaut)

source: timeout for SNMP in seconds (Default: 5)
fr: Temps maximum d'exécution SNMP en secondes (par défaut: 5)

source: prints version number
fr: Affiche le numéro de version du script

source: Set hostname or IP !
fr: Renseignez le nom d'hôte ou son IP !

source: Put snmp login info!
fr: Mettez des informations d'authentification SNMP !

source: Can't mix snmp v1,2c,3 protocols!
fr: Il n'est pas possible de mélanger les protocoles v1, 2c et 3!

source: Put snmp V3 login info with protocols!
fr: Renseignez le login pour SNMP v3!

source: Put snmp V3 priv login info with priv protocols!
fr: Renseignez le mot de passe privé avec SNMPv3 AuthPriv!

source: Unknown snmp protocol
fr: Protocole SNMP inconnu

source: AES protocol not supported on this system.
fr: Le protocole de chiffrement AES n'est pas supporté par ce système

source: Unknown snmpv3 auth protocol.
fr: Protocole SNMP d'authentification inconnu

source: Error generating a key (Ku) from the privacy pass phrase.
fr: Erreur de génération de la clé (Ku) de chiffrement.

source: Error generating key (Ku) from authentication pass phrase.
fr: Erreur de génération de la clé (Ku) de d'authentification.

source: : type not supported : %i
fr: : type non supporté : %i

source: Unkown option or missing argument (code 0%o)
fr: Option inconnue ou paramètre manquant (code 0%o)

source: Too much arguments (only options are needed) :
fr: Trop d'arguments (seules les options sont nécessaires) :

source: SNMP Network Interface Monitor for Nagios version %.2f
fr: Surveillance d'interface par SNMP pour Nagios version %.2f

source: Nagios SNMP plugins version %.2f, GPL licence, (c)2004-2007 Patrick Proy
fr: Plugins Nagios pour SNMP version %.2f, Licence GPL, (c)2005-2007 Patrick Proy

source: Name in description OID (eth0, ppp0 ...).
fr: Nom de l'interface dans l'OID description (eth0, PPP0 ...)

source: This is treated as a regexp : -n eth will match eth0,eth1,...
fr: La chaîne est traitée comme une expression régulière : eth sélectionnera eth0, eth1,...

source: Test it before, because there are known bugs (ex : trailling /)
fr: A tester avant la mise en production car il y a des bugs connus (ex : finir par /)

source: Do not use regexp to match NAME in description OID
fr: Ne pas utiliser les expressions régulières avec NAME

source: Make critical when up
fr: Renvoi CRITICAL lorsque l'interface est active (UP)

source: Use administrative status instead of operational
fr: Utilise le statut "administratif" plutôt que "opérationnel"

source: Consider "dormant" state is an OK state
fr: Considère l'état "dormant" comme OK également

source: Use cache file to store index
fr: Utilise un fichier cache pour les index SNMP

source: Optionnal validity time of index in minutes (default %i)
fr: Temps de validité en minutes de l'index (optionnel) (défaut : %i)

source: No space between K and the value as it is optionnal.
fr: Pas d'espace entre K et la valeur car paramètre optionnel.

source: Performance output (no output when interface is down).
fr: Sortie des données de performance (uniquement lorsque l'interface est active).

source: Add error & discard to performance output
fr: Ajoute les erreurs et suppressions dans la sortie de performance

source: Include speed in performance output in bits/s
fr: Ajoute la vitesse de l'interface dans la sortie de performance en bits/s

source: -y : output performance data in %% of max speed
fr: -y : sortie des données de performance en %% de la vitesse de l'interface

source: -Y : output performance data in bits/s or Bytes/s (depending on -B)
fr: -Y : sortie des données de performance en bits/s ou octets/s (en fonction de -B)

source: -k check the input/ouput bandwidth of the interface
fr: -k : vérifie le débit en entrée/sortie de l'interface

source: -q also check the error and discard input/output
fr: -q vérifie également les erreurs et les suppressions en entrée/sortie

source: Add label before speed in output : in=, out=, errors-out=, etc...
fr: Ajoute des indications sur les données d'entrée/sortie : in=,out=...

source: Use 64 bits counters instead of the standard counters when checking
fr: Utilise les compteurs 64bits au lieu des compteurs standards pour vérifier

source: bandwidth & performance data for interface >= 1Gbps.
fr: le débit des interfaces de débit > 1Gbps.

source: You must use snmp v2c or v3 to get 64 bits counters.
fr: Vous devez utilisez snmp v2c ou v3 pour avoir accès aux compteurs 64 bits.

source: make an average of <delta> seconds (default 300=5min)
fr: Effectue une moyenne sur <delta> secondes (par défaut : 300=5min)

source: Make the warning and critical levels in K|M|G Bits/s instead of K|M|G Bytes/s
fr: Permet de rensigner les seuils de warning et critical en K|M|G Bits/s au lieu de K|M|G Octets/s

source: -G : Make the warning and critical levels in Gbps (with -B) or GBps
fr: -G : Permet de spécifier les seuils en Gbps (avec -B) ou GBps

source: -M : Make the warning and critical levels in Mbps (with -B) or MBps
fr: -M : Permet de spécifier les seuils en Mbps (avec -B) ou MBps

source: -u : Make the warning and critical levels in %% of reported interface speed.
fr: -u : Permet de spécifier les seuils en %% de la vitesse de l'interface

source: warning level for input / output bandwidth (0 for no warning)
fr: Seuil de warning pour le débit de l'interface en entrée et sortie (0 pour désactiver).

source: unit depends on B,M,G,u options
fr: Les unités dépendent des options B,M,G et u

source: warning for error & discard input / output in error/min (need -q)
fr: warning pour erreur et suppression en entrée et sortie en erreur/min (-q requis)

source: critical level for input / output bandwidth (0 for no critical)
fr: Seuil critical pour le débit de l'interface en entrée et sortie (0 pour désactiver).

source: critical for error & discard input / output in error/min (need -q)
fr: critical pour erreur et suppression en entrée et sortie en erreur/min (-q requis)

source: Make the output shorter : only the first <n> chars of the interface(s)
fr: Rend la sortie plus courte : seulement les premiers <n> caractères de(s) interface(s)

source: If the number is negative, then get the <n> LAST caracters.
fr: Si le nombre est négatif, seulement les <n> derniers caractères.

source: Note : when multiple interface are selected with regexp,
fr: Note: Lorsque plusieurs interfaces sont sélectionnées (regexp),

source: all be must be up (or down with -i) to get an OK result.
fr: toutes doivent être active (ou inactives avec -i) pour retourner OK.

source: Put interface name
fr: Entrer le nom de l'interface

source: Can't get 64 bit counters with snmp version 1
fr: Les compteurs 64 bits ne sont pas accessibles avec SNMP v1

source: Cannot output error without -f option!
fr: Impossible de sortir les erreurs sans l'option -f !

source: -Y and -y options are exclusives
fr: Les options -y et -Y ne sont pas compatibles entre elles..

source: Cannot put -Y or -y options without perf check option (-k)
fr: Les options -Y et -y ont besoin de l'option -k

source: -S option need -k
fr: L'option -S nécessite l'option -k

source: 6 warning / critical levels for extended checks
fr: 6 niveau warning et critical pour les vérifications étendues

source: 2 warning /critical levels for bandwidth checks
fr: 2 niveaux warning et critical pour les vérifications de débit

source: Warning must be < Critical level
fr: Les seuils Warning doivent être < aux seuils Critical.

source: -M -G and -u options are exclusives
fr: Les options -M -G et -u ne sont pas compatibles entre elles.

source: Validity of cache must be >= 2 minutes
fr: La durée de validité du cache doit être >= 2 minutes

source: Error opening SNMP session : %s
fr: Erreur à l'ouverture de la session SNMP : %s

source: Memory allocation failure in cache file
fr: ERREUR : allocation mémoire impossible (fichier cache)

source: Error reading table : %s
fr: Erreur à la lecture de la table : %s

source: Error compiling regexp (invalid regexp or memory prb)
fr: Erreur lors de la compilation de l'expression régulière (regexp invalide ou problème mémoire)

source: Query OID %i :
fr: OID demandée %i :

source: Found : %i match : %i OID queries
fr: Trouvé : %i correspondances : %i requêtes

source: ERROR : Maximum number of OID queries reached : %i
fr: ERREUR: Nombre maximum d'OID atteint : %i

source: ERROR : Unknown interface %s
fr: ERREUR : interface inconnue %s

source: ERROR : memory allocation failure
fr: ERREUR : allocation mémoire impossible

source: Cannot get operationnal status of interface %s
fr: Impossible de récupérer le statut de l'interface %s

source: Cannot get admin status of interface %s
fr: Impossible de récupérer le statut de l'interface %s

source: Interface %s : state %i
fr: Interface %s : état %i

source: Cannot get interface speed using highperf mib : UNKNOWN
fr: Ne peut trouver la vitesse de l'interface en utilisant la mib highperf : UNKNOWN

source: Interface speed : %llu
fr: Vitesse d'interface : %llu

source: Write file returned : %i
fr: L'écriture du fichier retourne : %i

source: !!Unable to write file
fr: !! Impossible d'écrire le fichier temporaire

source: No usable data on file (
fr: Pas de données utilisables dans le fichier (

source: rows)
fr: lignes)

source: (Write problems in cache file)
fr: (problèmes d'écriture du fichier cache)

source: (Cache lock file remaining)
fr: (Lock du fichier cache persistant)

source: (Cache lock file cannot be erased)
fr: (Impossible de supprime le fichier lock du cache)

source: : %i int not %s
fr: : %i int ne sont pas %s

source: SNMP Process Monitor for Nagios version %.2f
fr: Surveillance de processus par SNMP pour Nagios version %.2f

source: Name of the process (regexp)
fr: Nom du processus (expression régulière)

source: No trailing slash !
fr: pas de '/' terminal

source: Use full path name instead of process name
fr: Utilise le chemin complet en plus du nom du processus

source: (Windows doesn't provide full path name)
fr: (Windows ne fourni pas de chemin complet)

source: Number of process that will cause a warning
fr: nombre de processus qui générant un état warning

source: -1 for no warning, MAX must be >0. Ex : -w-1,50
fr: -1 : pas de warning, MAX doit être >0. Ex : -w-1,50

source: number of process that will cause an error
fr: nombre de processus qui générant un état critical

source: -1 for no critical, MAX must be >0. Ex : -c-1,50
fr: -1 : pas de critical, MAX doit être >0. Ex : -c-1,50

source: Notes on warning and critical :
fr: Note sur les état warning et critical :

source: with the following options : -w m1,x1 -c m2,x2
fr: avec les options suivantes : -w m1,x1 -c m2,x2

source: you must have : m2 <= m1 < x1 <= x2
fr: Il faut que : m2 <= m1 < x1 <= x2

source: you can omit x1 or x2 or both
fr: Il est possible d'enlever x1, x2 ou les deux

source: checks memory usage (default max of all process)
fr: Vérifie l'utilisation mémoire (par défaut max des processus sélectionnés)

source: values are warning and critical values in Mb
fr: Seuils warning et critical en MOctets

source: makes an average of memory used by process instead of max
fr: Fait un moyenne de la mémoire utilisée au lieu du maximum

source: checks cpu usage of all process
fr: Vérifie l'utilisation CPU de tous les processus sélectionnés

source: values are warning and critical values in %% of CPU usage
fr: Seuils warning et critical en %% d'utilisation du CPU

source: if more than one CPU, value can be > 100%% : 100%%=1 CPU
fr: Si il y a plus d'un CPU, la valeur peut être > 100%% (100%%=1 CPU)

source: Performance output : number of processes
fr: Sortie des données de performance : nombre de processus

source: mem & cpu with -a and -u options)
fr: mémoire & cpu avec les options -a et -u)

source: make an average of <delta> seconds for cpu (default 300)
fr: Effectue une moyenne sur <delta> secondes (par défaut 300)

source: CPU usage is in %% of one cpu, so maximum can be 100%% * number of CPU
fr: L'utilisation CPU est en %% d'un cpu, le maximum peut donc être 100%% * nb de CPU

source: example :
fr: exemple :

source: Browse process list : <script> -C <community> -H <host> -n <anything> -v
fr: Liste le processus : <script> -C <community> -H <host> -n zzz -v

source: the -n option allows regexp in perl format :
fr: L'option -n utilise les expressions rationnelles pour la sélection :

source: All process of /opt/soft/bin : -n /opt/soft/bin/ -f
fr: Tous les processus de /opt/soft/bin : -n /opt/soft/bin/ -f

source: All 'named' process : -n named
fr: Tous les process 'named' : -n named

source: Put process name
fr: Entrer le nom du processus

source: Maximum process warninig and critical must be > 0
fr: Le seuil maximum warning et critical de processus doit être > 0

source: Warning minimum must be >= critical minimum
fr: Les seuils Warning minimum doivent être >= aux seuils Critical minimum

source: 2 values (warning,critical) for memory
fr: 2 valeurs (warning,critical) pour la mémoire

source: Warning must be <= Critical for memory!
fr: Les seuils Warning doivent être < aux seuils Critical pour la mémoire

source: 2 values (warning,critical) for cpu
fr: 2 valeurs (warning,critical) pour le cpu

source: Warning must be <= Critical for cpu!
fr: Le seuil Warning doit être < au seuil Critical pour le cpu.

source: No process %s %s found :
fr: Pas de processus %s %s trouvé :

source: named
fr: nommé(s)

source: matching
fr: correspondant(s) à

source: YOU told me it was : OK
fr: VOUS m'avez dit que c'était : OK

source: Process %i died between SNMP queries
fr: Le processus %i est mort entre deux requêtes SNMP

source: Memory average : %0.f
fr: Mémoire moyenne : %0.f

source: Memory max : %0.f
fr: Mémoire max : %0.f

source: ,CPU !!Unable to write file %s
fr: ,CPU !! Impossible d'écrire le fichier temporaire %s

source: , No data for CPU (%i) rows : UNKNOWN
fr: , pas de données pour le CPU (%i lignes) : UNKNOWN

source: SNMP storage Monitor for Nagios version %.2f
fr: Surveillance de systèmes de stockage par SNMP pour Nagios version %.2f

source: Name in description OID (can be mounpoints '/home' or 'Swap Space'...)
fr: Nom de l'interface dans l'OID description (Points de montage '/home' ou 'Swap Space')

source: This is treated as a regexp : -m /var will match /var , /var/log, /opt/var ...
fr: La chaîne est traitée comme une expression régulière : /var sélectionnera /var , /var/log, /opt/var ...

source: No trailing slash for mountpoints !
fr: pas de '/' terminal

source: Also check the storage type in addition of the name
fr: Vérifie également le type de storage en plus du nom

source: It is possible to use regular expressions ( "FixedDisk|FloppyDisk" )
fr: Il est possible d'utiliser des expressions rationnelles ( "FixedDisk|FloppyDisk" )

source: THEN make the tests.
fr: PUIS faire les tests.

source: Get storage from index instead of description table
fr: Récupère le storage grâce à son index au lieu de son nom

source: No cache, storage type and NAME must be an integer
fr: Pas de cache, type de storage et NAME doit être un entier

source: Select all storages except the one(s) selected by -m
fr: Selectionne tous les storage excepté celui ou ceux sélectionnés par -m

source: No action on storage type selection
fr: Sans effet sur la sélection par type de storage

source: pl : calculate percent left
fr: pl : Calcule le %% restant

source: pu : calculate percent used (Default)
fr: pu : Calcule le %% utilisé (défaut)

source: bl : calculate MegaBytes left
fr: bl : Calcule les MegaOctets restants

source: bu : calculate MegaBytes used
fr: bu : Calcule les MegaOctets utilisés

source: percent / MB of disk used to generate WARNING state
fr: Pourcentage ou MB/GB du disque pour générer un état WARNING

source: you can add the %% sign
fr: Il est possible d'ajouter le signe %%

source: percent / MB of disk used to generate CRITICAL state
fr: Pourcentage ou MB/GB du disque pour générer un état CRITICAL

source: Perfparse compatible output (default)
fr: Sorite de performance (par défaut)

source: output, warning & critical levels in gigabytes
fr: Sortie et seuils en GigOctets

source: <type>: Make the output shorter :
fr: <type>: Produit une sortie plus courte :

source: 0 : only print the global result except the disk in warning or critical
fr: 0 : affiche uniquement le résultat globale sauf pour les disques en état non OK

source: 1 : Don't print all info for every disk
fr: 1 : Ne pas afficher toutes les informations pour chaque disque

source: ex : "OK : / : 66 %%used (< 80)"
fr: ex : "OK : / : 66 %%utilisé (< 80)"

source: <cut>: take the <n> first caracters or <n> last if n<0
fr: <cut>: enlève les <n> premiers caractères ou les <n> derniers si n<0

source: By default, plugin will monitor %%used on drives :
fr: Par défaut, le plugin va vérifier le %% utilisé sur les disques :

source: warn if %%used > warn and critical if %%used > crit
fr: warn si %%used > warn et critical si %%used > crit

source: with T=pu or T=bu : OK < warn < crit
fr: avec T=pu or T=bu : OK < warn < crit

source: with T=pl ot T=bl : crit < warn < OK
fr: avec T=pl ot T=bl : crit < warn < OK

source: If multiple storage are selected, the worse condition will be returned
fr: Si de multiples storages sont sélectionnés, la pire condition sera retournée

source: i.e if one disk is critical, the return is critical
fr: i.e si un storage est critical, le retour sera critical

source: Browse storage list : <script> -C <community> -H <host> -m <anything> -w 1 -c 2 -v
fr: Parcourir la liste de storage : <script> -C <community> -H <host> -m <anything> -w 1 -c 2 -v

source: the -m option allows regexp in perl format :
fr: l'option -m autorise les expressions rationnelles :

source: Test drive C,F,G,H,I on Windows : -m ^[CFGHI]:
fr: Test lecteurs C,F,G,H,I sur Windows : -m ^[CFGHI]:

source: Test all mounts containing /var : -m /var
fr: Test tous les montages contenants /var : -m /var

source: Test all mounts under /var : -m ^/var
fr: Test tous les montages sous /var : -m ^/var

source: Test only /var : -m /var -r
fr: Test seulement /var : -m /var -r

source: Test all swap spaces : -m ^Swap
fr: Test tous les swap : -m ^Swap

source: Test all but swap spaces : -m ^Swap -e
fr: Test tout sauf le swap : -m ^Swap -e

source: Put storage name
fr: Entrer le nom de l'élément de stockage

source: Invalid check type : %s
fr: Type de vérification invalide : %s

source: Put warning level
fr: Entrer une valeur de warning

source: Put critical level
fr: Entrer le seuil critical

source: Warning and critical must be > 0
fr: Les valeurs de warning et critical doivent être > 0

source: warn must be < crit if type=%s
fr: Le seuil Warning doit être < au seuil Critical pour une vérification de type %s.

source: warn must be > crit if type=%s
fr: Le seuil Warning doit être > au seuil Critical pour une vérification de type %s.

source: percent values must be < 100
fr: Les pourcentages doivent être < 100

source: -S first option must be 0 or 1
fr: La première option de -S doit être 0 ou 1

source: Put integer as storage name with index selection
fr: Mettez un entier comme nom de storage pour la sélection par index

source: No cache or storage type with index selection
fr: Pas de cache ou de type de storage avec une sélection par index

source: UNKNOWN : Unknown storage type corresponding to oid :
fr: UNKNOWN : Disque inconnu correspondant à l'OID :

source: Can't find storage type OID for storage %s : UNKNOWN
fr: Impossible de trouver l'OID de type pour le storage %s : UNKNOWN

source: ERROR : Unknown storage %s
fr: ERREUR : montage inconnu %s
